---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstrainedHandle.IsCustomHandle
source: html/4dd5e9ef-3ad4-2c42-fcd7-5c425943e5e0.htm
---
# Autodesk.Revit.DB.Structure.RebarConstrainedHandle.IsCustomHandle Method

Returns true if the RebarHandleType of the RebarConstrainedHandle is 'CustomHandle'.

## Syntax (C#)
```csharp
public bool IsCustomHandle()
```